{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### MVP для приложения банка"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Финансовое учреждение планирует внедрить новый инвестиционный инструмент. Суть данного предложения заключается в том, что вкладчики получают возможность инвестировать средства в ценные бумаги выбранной организации, чья рыночная стоимость подвержена колебаниям. Как следствие, динамика инвестиционного портфеля клиента напрямую зависит от изменения котировок акций: при росте стоимости акций увеличивается и размер вложений, а при падении – соответственно, уменьшается.\n",
    "\n",
    "Для MVP требуется реализация следующего набора возможностей:\n",
    "- Покупка акций \n",
    "- Продажа акций \n",
    "- Событие увеличения цены акций некоторой компании на x% \n",
    "- Событие снижения цены акций некоторой компании на x%\n",
    "- Запрос суммарной стоимости портфеля клиента\n",
    "\n",
    "Исходные условия:\n",
    "1) Всем клиентам финансового учреждения были предустановлены личные кабинеты с нулевым балансом.<br>\n",
    "2) Акции всех компаний на старте стоят 1$.<br>\n",
    "3) На вход поступают только клиенты данного финансового учреждения.<br>\n",
    "\n",
    "Исходные данные считываются из файла 'input.txt', представляющего собой перечень команд. <br>\n",
    "Допустимые типы команд:\n",
    "- В первой строке вводится целое число n - количество операций\n",
    "- BUY client company value - купить для client акции company в количестве value.\n",
    "- SELL client company value - продать для client акции company в количестве value. Если у клиента нет столько акций, то продаем сколько возможно.\n",
    "- PRICE_RAISE company percents - акции company растут в цене на percents процентов\n",
    "- PRICE_FALL company percents - акции company падают в цене на percents процентов\n",
    "- BALANCE client - нужно вывести сколько денег в портфеле клиента\n",
    "\n",
    "Для каждого запроса типа BALANCE программа должна рассчитывать и отображать общую сумму средств, находящихся в инвестиционном портфеле клиента.\n",
    "Полученное значение общей суммы необходимо округлить до ближайшего целого числа, используя функцию round."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "105300\n"
     ]
    }
   ],
   "source": [
    "class Company:\n",
    "    def __init__(self, name, price=1.0):\n",
    "        self.name = name\n",
    "        self.price = price\n",
    "    \n",
    "    def Raise(self, percents):\n",
    "        self.price += self.price * percents / 100\n",
    "\n",
    "    def Fall(self, percents):\n",
    "        self.price -= self.price * percents / 100\n",
    "\n",
    "    def __repr__(self) -> str:\n",
    "        return f'Company({self.name}, {self.price})'\n",
    "\n",
    "class Client:\n",
    "    def __init__(self, name):\n",
    "        self.name = name\n",
    "        self.portfolio = dict()\n",
    "\n",
    "    def Buy(self, company, value):\n",
    "        if company not in self.portfolio:\n",
    "            self.portfolio[company] = 0\n",
    "        self.portfolio[company] += value\n",
    "\n",
    "    def Sell(self, company, value):\n",
    "        if company not in self.portfolio:\n",
    "            self.portfolio[company] = 0\n",
    "        if self.portfolio[company] <= value:\n",
    "            self.portfolio[company] = 0\n",
    "        else:\n",
    "            self.portfolio[company] -= value\n",
    "\n",
    "\n",
    "    def Balance(self, companies):\n",
    "        balance = 0\n",
    "        for company in self.portfolio:\n",
    "            balance += companies[company].price * self.portfolio[company]\n",
    "        return round(balance)\n",
    "\n",
    "f = open('input.txt')\n",
    "\n",
    "n = int(f.readline())\n",
    "\n",
    "companies = dict()\n",
    "clients = dict()\n",
    "\n",
    "for s in f:\n",
    "    p = s.split()\n",
    "    \n",
    "    if p[0] == 'PRICE_FALL':\n",
    "        company = p[1]\n",
    "        percents = float(p[2])\n",
    "        if company not in companies:\n",
    "            companies[company] = Company(company, 1.0)\n",
    "        companies[company].Fall(percents)\n",
    "\n",
    "    if p[0] == 'PRICE_RAISE':\n",
    "        company = p[1]\n",
    "        percents = float(p[2])\n",
    "        if company not in companies:\n",
    "            companies[company] = Company(company, 1.0)\n",
    "        companies[company].Raise(percents)\n",
    "\n",
    "    if p[0] == 'BUY':\n",
    "        client = p[1]\n",
    "        company = p[2]\n",
    "        value = int(p[3])\n",
    "        if company not in companies:\n",
    "            companies[company] = Company(company, 1.0)\n",
    "        if client not in clients:\n",
    "            clients[client] = Client(client)\n",
    "        clients[client].Buy(company, value)\n",
    "        \n",
    "\n",
    "    if p[0] == 'SELL':\n",
    "        client = p[1]\n",
    "        company = p[2]\n",
    "        value = int(p[3])\n",
    "        if company not in companies:\n",
    "            companies[company] = Company(company, 1.0)\n",
    "        if client not in clients:\n",
    "            clients[client] = Client(client)\n",
    "        clients[client].Sell(company, value)\n",
    "    \n",
    "    if p[0] == 'BALANCE':\n",
    "        client = p[1]\n",
    "        if client not in clients:\n",
    "            clients[client] = Client(client)\n",
    "        balance = clients[client].Balance(companies)\n",
    "        print(balance)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
